WELCOME_TEXT = """Привет! Я бот для организации игр"""

WELCOME_RULES = """
Формат игры:

Турнир в холдем на вылет с возможностью докупа. Турнир с начислением очков.

Правила при докупе:
    1) Докуп возможен при малом блаинде <= 50
    2) При докупе участник получает вдвое меньше турнирных очков
    3) Сумму докупа фиксирована и совпадает с начальным положением фишек игрока
    4) Докуп возможен, когда число активных игроков >= 3

Сбор:
    Каждый месяц, голосование по выбору дня (мб места) за неделю до игры

Количество мест:
    От 5 До 14

Правила начисления очков:
Первые 5 мест:

15, 10, 8, 5, 3 очков

1 - всем участникам

После 10 отборочных игр: финальная игра с участием 8 лучших игроков
"""


WELCOME_REGISTER = """Отлично, давай познакомимся!
Давай заведем тебе особый логин для отображения в таблице лидеров.

Для этого ответным сообщением пришли мне желаемый логин на латинице
"""


SUCCESS_REGISTER = """Добро пожаловать в клуб, <b>{}</b>.
Теперь ты зарегистрирован и можешь пользоваться всеми функциями бота:

- Просмотр внутриигровой статистики
- Просмотр результатов прошлых матчей
- Просмотр будущих турниров

Также после того как админ добавит новый турнир - я предложу тебе принять в нем участие!
"""
